# Occupiable Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..Occupiable Property
Space Class See Also
---
Reports whether this zone is Occupiable or not.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool Occupiable { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Occupiable As Boolean
	Get
```

Visual C++
---
```text
public:
property bool Occupiable {
	bool get ();
}
```

# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace